STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/LoRaWAN_FUOTA_DualCore/LoRaWAN_End_Node_DualCore/CM4/MbMux/LmHandler_mbwrapper.c
  /* USER CODE END LmHandlerGetNwkKey_2 */
}

LmHandlerErrorStatus_t LmHandlerSetNwkKey(uint8_t *nwkKey)
{
  /* USER CODE BEGIN LmHandlerSetNwkKey_1 */

  /* USER CODE END LmHandlerSetNwkKey_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetNwkKey_2 */

  /* USER CODE END LmHandlerSetNwkKey_2 */
}

LmHandlerErrorStatus_t LmHandlerGetAppKey(uint8_t *appKey)
{
  /* USER CODE BEGIN LmHandlerGetAppKey_1 */

  /* USER CODE END LmHandlerGetAppKey_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetAppKey_2 */

  /* USER CODE END LmHandlerGetAppKey_2 */
}

LmHandlerErrorStatus_t LmHandlerSetAppKey(uint8_t *appKey)
{
  /* USER CODE BEGIN LmHandlerSetAppKey_1 */

  /* USER CODE END LmHandlerSetAppKey_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetAppKey_2 */

  /* USER CODE END LmHandlerSetAppKey_2 */
}

LmHandlerErrorStatus_t LmHandlerGetNwkSKey(uint8_t *nwkSKey)
{
  /* USER CODE BEGIN LmHandlerGetNwkSKey_1 */

  /* USER CODE END LmHandlerGetNwkSKey_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetNwkSKey_2 */

  /* USER CODE END LmHandlerGetNwkSKey_2 */
}

LmHandlerErrorStatus_t LmHandlerSetNwkSKey(uint8_t *nwkSKey)
{
  /* USER CODE BEGIN LmHandlerSetNwkSKey_1 */

  /* USER CODE END LmHandlerSetNwkSKey_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetNwkSKey_2 */

  /* USER CODE END LmHandlerSetNwkSKey_2 */
}

LmHandlerErrorStatus_t LmHandlerGetAppSKey(uint8_t *appSKey)
{
  /* USER CODE BEGIN LmHandlerGetAppSKey_1 */

  /* USER CODE END LmHandlerGetAppSKey_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetAppSKey_2 */

  /* USER CODE END LmHandlerGetAppSKey_2 */
}

LmHandlerErrorStatus_t LmHandlerSetAppSKey(uint8_t *appSKey)
{
  /* USER CODE BEGIN LmHandlerSetAppSKey_1 */

  /* USER CODE END LmHandlerSetAppSKey_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetAppSKey_2 */

  /* USER CODE END LmHandlerSetAppSKey_2 */
}

LmHandlerErrorStatus_t LmHandlerGetNetworkID(uint32_t *networkId)
{
  /* USER CODE BEGIN LmHandlerGetNetworkID_1 */

  /* USER CODE END LmHandlerGetNetworkID_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetNetworkID_2 */

  /* USER CODE END LmHandlerGetNetworkID_2 */
}

LmHandlerErrorStatus_t LmHandlerSetNetworkID(uint32_t networkId)
{
  /* USER CODE BEGIN LmHandlerSetNetworkID_1 */

  /* USER CODE END LmHandlerSetNetworkID_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetNetworkID_2 */

  /* USER CODE END LmHandlerSetNetworkID_2 */
}

LmHandlerErrorStatus_t LmHandlerGetDevAddr(uint32_t *devAddr)
{
  /* USER CODE BEGIN LmHandlerGetDevAddr_1 */

  /* USER CODE END LmHandlerGetDevAddr_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetDevAddr_2 */

  /* USER CODE END LmHandlerGetDevAddr_2 */
}

LmHandlerErrorStatus_t LmHandlerSetDevAddr(uint32_t devAddr)
{
  /* USER CODE BEGIN LmHandlerSetDevAddr_1 */

  /* USER CODE END LmHandlerSetDevAddr_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetDevAddr_2 */

  /* USER CODE END LmHandlerSetDevAddr_2 */
}

LmHandlerErrorStatus_t LmHandlerGetActiveRegion(LoRaMacRegion_t *region)
{
  /* USER CODE BEGIN LmHandlerGetActiveRegion_1 */

  /* USER CODE END LmHandlerGetActiveRegion_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetActiveRegion_2 */

  /* USER CODE END LmHandlerGetActiveRegion_2 */
}

LmHandlerErrorStatus_t LmHandlerSetActiveRegion(LoRaMacRegion_t region)
{
  /* USER CODE BEGIN LmHandlerSetActiveRegion_1 */

  /* USER CODE END LmHandlerSetActiveRegion_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetActiveRegion_2 */

  /* USER CODE END LmHandlerSetActiveRegion_2 */
}

LmHandlerErrorStatus_t LmHandlerGetAdrEnable(bool *adrEnable)
{
  /* USER CODE BEGIN LmHandlerGetAdrEnable_1 */

  /* USER CODE END LmHandlerGetAdrEnable_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetAdrEnable_2 */

  /* USER CODE END LmHandlerGetAdrEnable_2 */
}

LmHandlerErrorStatus_t LmHandlerSetAdrEnable(bool adrEnable)
{
  /* USER CODE BEGIN LmHandlerSetAdrEnable_1 */

  /* USER CODE END LmHandlerSetAdrEnable_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetAdrEnable_2 */

  /* USER CODE END LmHandlerSetAdrEnable_2 */
}

LmHandlerErrorStatus_t LmHandlerGetTxDatarate(int8_t *txDatarate)
{
  /* USER CODE BEGIN LmHandlerGetTxDatarate_1 */

  /* USER CODE END LmHandlerGetTxDatarate_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetTxDatarate_2 */

  /* USER CODE END LmHandlerGetTxDatarate_2 */
}

LmHandlerErrorStatus_t LmHandlerSetTxDatarate(int8_t txDatarate)
{
  /* USER CODE BEGIN LmHandlerSetTxDatarate_1 */

  /* USER CODE END LmHandlerSetTxDatarate_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetTxDatarate_2 */

  /* USER CODE END LmHandlerSetTxDatarate_2 */
}

LmHandlerErrorStatus_t LmHandlerGetDutyCycleEnable(bool *dutyCycleEnable)
{
  /* USER CODE BEGIN LmHandlerGetDutyCycleEnable_1 */

  /* USER CODE END LmHandlerGetDutyCycleEnable_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetDutyCycleEnable_2 */

  /* USER CODE END LmHandlerGetDutyCycleEnable_2 */
}

LmHandlerErrorStatus_t LmHandlerSetDutyCycleEnable(bool dutyCycleEnable)
{
  /* USER CODE BEGIN LmHandlerSetDutyCycleEnable_1 */

  /* USER CODE END LmHandlerSetDutyCycleEnable_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerSetDutyCycleEnable_2 */

  /* USER CODE END LmHandlerSetDutyCycleEnable_2 */
}

LmHandlerErrorStatus_t LmHandlerGetRX2Params(RxChannelParams_t *rxParams)
{
  /* USER CODE BEGIN LmHandlerGetRX2Params_1 */

  /* USER CODE END LmHandlerGetRX2Params_1 */
  return (LmHandlerErrorStatus_t) 0UL;
  /* USER CODE BEGIN LmHandlerGetRX2Params_2 */

  /* USER CODE END LmHandlerGetRX2Params_2 */
}

